In [1]:
import numpy as np
import pandas as pd

# 1.归约方法：

#### sum()方法：

In [2]:
df = pd.DataFrame([[1.8,np.nan],[7.7,-5.5],[np.nan,np.nan],[0.9,-1.5]],index=['a','b','c','d'],columns=['one','two'])
df

   one  two
a  1.8  NaN
b  7.7 -5.5
c  NaN  NaN
d  0.9 -1.5

In [3]:
df.sum()

one    10.4
two    -7.0
dtype: float64

In [4]:
df.sum(axis=1)

a    1.8
b    2.2
c    0.0
d   -0.6
dtype: float64

In [5]:
df.sum(axis='columns',skipna=False)

a    NaN
b    2.2
c    NaN
d   -0.6
dtype: float64

#### mean()方法：

In [6]:
df.mean(axis=1)

a    1.8
b    1.1
c    NaN
d   -0.3
dtype: float64

# 2.积累型方法：

In [7]:
df = pd.DataFrame([[1.8,np.nan],[7.7,-5.5],[np.nan,np.nan],[0.9,-1.5]],index=['a','b','c','d'],columns=['one','two'])
df

   one  two
a  1.8  NaN
b  7.7 -5.5
c  NaN  NaN
d  0.9 -1.5

In [8]:
df.cumsum()

    one  two
a   1.8  NaN
b   9.5 -5.5
c   NaN  NaN
d  10.4 -7.0

In [9]:
df.cumsum(axis='columns')

   one  two
a  1.8  NaN
b  7.7  2.2
c  NaN  NaN
d  0.9 -0.6

# 3.其他方法：

### describe()方法

In [10]:
df = pd.DataFrame(np.arange(8).reshape(4,2),index=['a','b','c','d'],columns=['one','two'])
df

   one  two
a    0    1
b    2    3
c    4    5
d    6    7

In [11]:
df.describe()

            one       two
count  4.000000  4.000000
mean   3.000000  4.000000
std    2.581989  2.581989
min    0.000000  1.000000
25%    1.500000  2.500000
50%    3.000000  4.000000
75%    4.500000  5.500000
max    6.000000  7.000000

In [12]:
# 在非数值数据上，describe()方会产生其他的汇总统计

In [13]:
df = pd.DataFrame({"one":pd.Series(["a", "a", "b", "c"] * 3) ,"two":pd.Series(["a", "b", "b", "b"] * 3) })
df

   one two
0    a   a
1    a   b
2    b   b
3    c   b
4    a   a
5    a   b
6    b   b
7    c   b
8    a   a
9    a   b
10   b   b
11   c   b

In [14]:
df.describe()

       one two
count   12  12
unique   3   2
top      a   b
freq     6   9

### idxmin()和idxmax()方法

In [15]:
df = pd.DataFrame([[1.8,np.nan],[7.7,-5.5],[np.nan,np.nan],[0.9,-1.5]],index=['a','b','c','d'],columns=['one','two'])
df

   one  two
a  1.8  NaN
b  7.7 -5.5
c  NaN  NaN
d  0.9 -1.5

In [16]:
df.idxmin()

one    d
two    b
dtype: object

In [17]:
df.idxmax()

one    b
two    d
dtype: object